#1) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი 10-ჯერ.

for number in range(10):
    print("gio")
    
#2) მომხმარებელს შემოაყვანინეთ სამი რიცხვი (start, end და step), შემდგომ
# ეს ინფორმაცია ჩასვით სათანადო ადგილებში for ციკლის range ფუნქციაში და
# გამოიტანეთ რიცხვები start-იდან step-ის ჩათვლით.

start = 10
end = 12
step = 8

for number in range(1):
    print(start)
    print(end)
    print(step)
    
#3) მომხმარებელს შემოაყვანინეთ ერთი რიცხვი n-ი, შემდგომ გამოითვალეთ
# ლუწი რიცხვების ჯამი 0-იდან მომხმარებლის რიცხვის ჩათვლით
# და საბოლოოდ როდესაც ციკლი დასრულდება - გამოიტანეთ ლუწი რიცხვების ჯამი.

n = int(input("please enter your number: "))

for number in range(0, n + 1):
    print(number)
    




