# 1) მოიყვანეთ ლოგიკური ოპერატორების გამოყენების მაგალითები (and, or, not),
# and ოპერატორზე და or ოპერატორზე უნდა მოიყვანოთ 4-4 მაგალითი
# (4 შესაძლო ვარიანტი როგორც შეიძლება დასრულდეს პირობა) და not ოპერატორზე სულ 2 მაგალითი

print(60 < 80 and (50 > 60 or 20 < 10))
print(50 > 20 and 10 < 20 or 20 < 10)
print(20 < 30 or 20 > 30 and 60 < 40)
print(40 > 20 and (30 > 20 or 40 < 20))
print(40 >60 and not 20 > 30 or not 60 > 40)
print(50 > 30 and (not 80 > 90 or 20 < 30))

# 2) კოდის გაშვების გარეშე გაიგეთ რას დაგიბრუნებთ შემდეგი კოდი (კომენტარის სახით დაწერეთ პასუხი True ან False):

1.
print(True and not 5 < 6 or (90 > 81) and not 76 == 83)
# print(true)

2.
print(10 >= 10 and 9 < 81 or not True and not 90 >= 90)
#print(true)