# 1) while ციკლის გამოყენებით გამოიტანეთ ტერმინალში თქვენი სახელი 20-ჯერ.


    
#2) while ციკლის დახმარებით გამოიტანეთ მხოლოდ ლუწი რიცხვები 0-იდან 100-ის ჩათვლით.

i = 0
while i <= 100:
    print(i)
    i += 2
    
#3) შექმენით ცვლადი სახელად correct_password, შემდგომ შეინახეთ მასში სწორი პაროლი მაგალითად "python123",
# შემდგომ მომხმარებელს შემოაყვანინეთ პაროლი და მანამ,
# სანამ მომხმარებელი არ შეიყვანს სწორ პაროლს - ხელახლა მოსთხოვეთ პაროლის შემოყვანა,
# იმ შემთხვევაში თუ მომხმარებელმა პაროლი შემოიყვანა სწორად ტერმინალში გამოუტანეთ "Access Granted!".

correct_password = "python123"

